app/controllers/boxes_controller.rb

  def index
    @boxes = Box.all
---
SELECT "boxes".* FROM "boxes"

  def create
    @box = Box.new(box_params)
# save method returns either true or false
    if @box.save
---
INSERT INTO "boxes" ("grade", "reading_level", "description", "contents") VALUES ($1, $2, $3, $4) RETURNING "id"  [["grade", "jkhjkhk"], ["reading_level", "sdfjksdfh"], ["description", "Great food, great music"], ["contents", "ksdjlkajsdljs"]]

  def update
    if @box.update(box_params)
---
UPDATE "boxes" SET "grade" = $1, "contents" = $2 WHERE "boxes"."id" = $3  [["grade", "First"], ["contents", "This box is huge"], ["id", 121]]

  def destroy
    @box.destroy
---
DELETE FROM "boxes" WHERE "boxes"."id" = $1  [["id", 123]]

    def set_box
      @box = Box.find(params[:id])
---
SELECT "boxes".* FROM "boxes" WHERE "boxes"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]